Revit 2022 API
Element.GetAnalyticalModelId Method
 Retrieves the Element Id of the Analytical Model Element for this Element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public ElementId GetAnalyticalModelId()
Visual Basic
Public Function GetAnalyticalModelId As ElementId
Visual C++
public:
ElementId^ GetAnalyticalModelId()
Return Value
 Element Id.
Remarks
 If the Element does not have an Analytical Model, the returned value will be invalidElementId. This may occur even if the Element can have an Analytical Model, but does not for some reason.
See Also
Element Class
Autodesk.Revit.DB Namespace